### summary
- pandas
    - 데이터 분석 : 데이터 전처리 파트
    - 테이블 형태의 데이터를 처리할때 사용하는 python 라이브러리
    - Series; DataFrame
    - Series
        - 생성, 선택, 수정 방법
    - DataFrame
        - 생성 방법 1 : 딕셔너리의 리스트 : 리스트 -> 컬럼
        - 생성 방법 2 : 리스트의 딕셔너리 : 딕셔너리 -> 로우 데이터
        - row 선택 : `df.loc[idx]`
        - column 선택 : `df[column name]`
        - row, column 선택 : `df.loc[idx, column]`
        - 함수
            - apply, append, concat
            - groupby, merge

In [1]:
import makedata

In [16]:
makedata.get_name()

'Billy'

In [15]:
makedata.get_age()

21

In [20]:
makedata.make_data()

[{'Age': 22, 'Name': 'Anchal'},
 {'Age': 27, 'Name': 'Jin'},
 {'Age': 37, 'Name': 'Andrew'},
 {'Age': 29, 'Name': 'Jin'},
 {'Age': 38, 'Name': 'Anchal'},
 {'Age': 20, 'Name': 'Andrew'},
 {'Age': 34, 'Name': 'Anthony'},
 {'Age': 21, 'Name': 'Anthony'},
 {'Age': 36, 'Name': 'Anthony'},
 {'Age': 28, 'Name': 'Anthony'}]

### quiz
- makedata 모듈을 이용해서 데이터 프레임 만들기
- user_df
    - UserID : 1~8
    - Name : makedata.get_name()
    - Age : makedata.get_age()
    - 중복되는 Name 값이 없도록

In [24]:
# 딕셔너리의 리스트 : UserID, Name, Age
datas = {}
datas["UserID"] = list(range(1,9))
datas["Age"] = [makedata.get_age() for _ in range(8)]
names = []
while True:
    name = makedata.get_name()
    if name not in names:
        names.append(name)
    if len(names) >= 8:
        break
datas["Name"] = names

user_df = pd.DataFrame(datas)
user_df

   UserID  Age    Name
0       1   36    Adam
1       2   35  Arnold
2       3   34  Anchal
3       4   27  Andrew
4       5   31   Billy
5       6   26    Alex
6       7   22   Alvin
7       8   34    Alan

Empty DataFrame
Columns: [UserID, Name, Age]
Index: []

In [34]:
# 리스트의 딕셔너리 : UserID, Name, Age
user_df = pd.DataFrame(columns=["UserID", "Name", "Age"])
datas = []

for idx in range(1,9):
    
    name = makedata.get_name()
    while name in list(user_df["Name"]):
        name = makedata.get_name()
    data = {"Name":name, "UserID":idx, "Age":makedata.get_age()}
    
    user_df.loc[len(user_df)] = data

user_df

  UserID     Name Age
0      1  Anthony  21
1      2   Anchal  29
2      3    Alvin  31
3      4   Andrew  21
4      5    Billy  24
5      6     Alex  28
6      7      Jin  21
7      8     Adam  38

In [ ]:
### quiz2
- money_df 만들기
    - 15개의 데이터
    - ID : 1 ~ 8 랜덤
    - Money : 1000원 단위로 1000원 ~ 20000원까지의 숫자가 저장

In [31]:
# 딕셔너리 데이터를 데이터 프레임에 하나씩 추가하기
money_df = pd.DataFrame(columns=["ID","Money"])
# np.random.randint(1,9)
for _ in range(15):
    money_df.loc[len(money_df)] = {
        "ID" : np.random.randint(1,9),
        "Money" : np.random.randint(1, 21) * 1000
    }

# 컬럼데이터에서 Unique 값 확인
ids = money_df["ID"].unique()
ids.sort()
ids

array([1, 2, 3, 5, 7, 8], dtype=object)

In [32]:
money_df

   ID  Money
0   7   7000
1   8  11000
2   1  12000
3   8  14000
4   5   3000
5   1   9000
6   8  13000
7   5  17000
8   5   7000
9   5   8000
10  5  11000
11  2   8000
12  2   1000
13  8   5000
14  3   7000

In [36]:
user_df

  UserID     Name Age
0      1  Anthony  21
1      2   Anchal  29
2      3    Alvin  31
3      4   Andrew  21
4      5    Billy  24
5      6     Alex  28
6      7      Jin  21
7      8     Adam  38